In [65]:
import pandas as pd
import numpy as np
from pathlib import Path
%matplotlib inline
import seaborn as sns
import datetime as dt

In [66]:
# Reading whale returns
whale_returns_csv = Path("whale_returns.csv")
whale_df = pd.read_csv(whale_returns_csv)
whale_df.sort_index(ascending=True)
whale_df.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,2015-03-02,NaN,NaN,NaN,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [6]:
#Count nulls
whale_df.isnull().sum()

Date                           0
SOROS FUND MANAGEMENT LLC      1
PAULSON & CO.INC.              1
TIGER GLOBAL MANAGEMENT LLC    1
BERKSHIRE HATHAWAY INC         1
dtype: int64

In [12]:
# Drop nulls
whale_df = whale_df.dropna()

In [13]:
whale_df.isnull().sum()

Date                           0
SOROS FUND MANAGEMENT LLC      0
PAULSON & CO.INC.              0
TIGER GLOBAL MANAGEMENT LLC    0
BERKSHIRE HATHAWAY INC         0
dtype: int64

In [69]:
# Reading algorithmic returns
algo_returns_csv = Path("algo_returns.csv")
algo_df = pd.read_csv(algo_returns_csv)
algo_df.sort_index(ascending=True).head()

         Date    Algo 1  Algo 2
0  2014-05-28  0.001745     NaN
1  2014-05-29  0.003978     NaN
2  2014-05-30  0.004464     NaN
3  2014-06-02  0.005692     NaN
4  2014-06-03  0.005292     NaN

In [42]:
#Count nulls
algo_df.isnull().mean()*100
algo_df.isnull().sum()

Date      0
Algo 1    0
Algo 2    6
dtype: int64

In [43]:
algo_df = algo_df.dropna()
algo_df.isnull().sum()

Date      0
Algo 1    0
Algo 2    0
dtype: int64

In [74]:
# Reading S&P 500 Closing Prices
sp500_history_csv = Path("sp500_history.csv")
sp500_df = pd.read_csv(sp500_history_csv,parse_dates=True,infer_datetime_format=True)
sp500_df.sort_index(ascending=True)

           Date     Close
0     23-Apr-19  $2933.68
1     22-Apr-19  $2907.97
2     18-Apr-19  $2905.03
3     17-Apr-19  $2900.45
4     16-Apr-19  $2907.06
...         ...       ...
1644   5-Oct-12  $1460.93
1645   4-Oct-12  $1461.40
1646   3-Oct-12  $1450.99
1647   2-Oct-12  $1445.75
1648   1-Oct-12  $1444.49

[1649 rows x 2 columns]

In [48]:
# Check Data Types
sp500_df.dtypes

Date     object
Close    object
dtype: object

In [49]:
#Fix Data Types
sp500_df['Close'] = sp500_df['Close'].str.replace('$', '')

In [50]:
sp500_df['Close'] = sp500_df['Close'].astype('float')
sp500_df['Close'].dtypes

dtype('float64')

In [57]:
sp500_daily_returns = sp500_df['Close'].pct_change()
sp500_daily_returns.head()

0         NaN
1   -0.008764
2   -0.001011
3   -0.001577
4    0.002279
Name: Close, dtype: float64